ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_ips.c
/***************************************************************************//**
* \file CY_BLE_ips.c
* \version 2.0
*
* \brief
*  Contains the source code for Indoor Positioning Service.
*
********************************************************************************
* \copyright
* Copyright 2017, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#include "cy_ble_event_handler.h"

/* C binding of definitions if building with C++ compiler */
#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

#if (CY_BLE_MODE_PROFILE && defined(CY_BLE_IPS))

#ifdef CY_BLE_IPS_CLIENT
/* Server's Indoor Positioning Service characteristics GATT DB handles structure */
cy_stc_ble_ipsc_t cy_ble_ipsc[CY_BLE_CONFIG_GATTC_COUNT];

/* The internal storage for the last request handle to check response */
static cy_ble_gatt_db_attr_handle_t cy_ble_ipscReqHandle[CY_BLE_CONFIG_GATTC_COUNT];

/* Read Long Descriptors variables */
static uint8_t *cy_ble_ipscRdLongBuffPtr[CY_BLE_CONFIG_GATTC_COUNT] = { NULL };
static uint16_t cy_ble_ipscRdLongBuffLen[CY_BLE_CONFIG_GATTC_COUNT] = { 0u };
static uint16_t cy_ble_ipscCurrLen[CY_BLE_CONFIG_GATTC_COUNT] = { 0u };
#endif /* (CY_BLE_IPS_CLIENT) */

static cy_ble_callback_t Cy_BLE_IPS_ApplCallback = NULL;

/* The pointer on global BLE IPS Config structure */
cy_stc_ble_ips_config_t *cy_ble_ipsConfigPtr = NULL;

/***************************************
* Private Function Prototypes
***************************************/
#ifdef CY_BLE_IPS_SERVER
static cy_en_ble_gatt_err_code_t Cy_BLE_IPSS_WriteEventHandler(cy_stc_ble_gatts_write_cmd_req_param_t *eventParam);
static void Cy_BLE_IPSS_PrepareWriteRequestEventHandler(const cy_stc_ble_gatts_prep_write_req_param_t *eventParam);
static void Cy_BLE_IPSS_ExecuteWriteRequestEventHandler(cy_stc_ble_gatts_exec_write_req_t *eventParam);
static void Cy_BLE_IPSS_WriteCmdEventHandler(cy_stc_ble_gatts_write_cmd_req_param_t *eventParam);
static cy_en_ble_api_result_t Cy_BLE_IPSS_SetAdvertisementData(void);
#endif /* CY_BLE_IPS_SERVER */

#ifdef CY_BLE_IPS_CLIENT
static void Cy_BLE_IPSC_DiscoverCharacteristicsEventHandler(cy_stc_ble_disc_char_info_t *discCharInfo);
static void Cy_BLE_IPSC_DiscoverCharDescriptorsEventHandler(cy_stc_ble_disc_descr_info_t *discDescrInfo);
static void Cy_BLE_IPSC_GetCharRange(cy_stc_ble_disc_range_info_t *charRangeInfo);
static void Cy_BLE_IPSC_ReadResponseEventHandler(cy_stc_ble_gattc_read_rsp_param_t *eventParam);
static void Cy_BLE_IPSC_ReadMultipleResponseEventHandler(cy_stc_ble_gattc_read_rsp_param_t *eventParam);
static void Cy_BLE_IPSC_ReadLongRespEventHandler(const cy_stc_ble_gattc_read_rsp_param_t *eventParam);
static void Cy_BLE_IPSC_WriteResponseEventHandler(const cy_stc_ble_conn_handle_t *eventParam);
static void Cy_BLE_IPSC_ErrorResponseEventHandler(const cy_stc_ble_gatt_err_param_t *eventParam);
static void Cy_BLE_IPSC_ExecuteWriteResponseEventHandler(const cy_stc_ble_gattc_exec_write_rsp_t *eventParam);
#endif /* CY_BLE_IPS_CLIENT */
static cy_en_ble_gatt_err_code_t Cy_BLE_IPS_EventHandler(uint32_t eventCode, void *eventParam);


/******************************************************************************
* Function Name: Cy_BLE_IPS_Init
***************************************************************************//**
*
*  This function initializes the Indoor Positioning Service.
*  Initializes the profile internals.
*
*  \param config: Configuration structure for the Indoor Positioning Service.
*
*  \return
*  cy_en_ble_api_result_t : Return value indicates if the function succeeded or
*  failed. The following are possible error codes.
*
*   Error Codes                             | Description
*   ------------                            | -----------
*   CY_BLE_SUCCESS                          | The function completed successfully.
*   CY_BLE_ERROR_INVALID_PARAMETER          | On specifying NULL as input parameter
*   CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED   | Buffer overflow in the registration callback.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_IPS_Init(cy_stc_ble_ips_config_t *config)
{
    cy_en_ble_api_result_t apiResult;

    if(config == NULL)
    {
        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
    }
    else
    {
        /* Registers a pointer to config structure */
        cy_ble_ipsConfigPtr = config;

        /* Registers Event Handler for the IPS Service */
        apiResult = Cy_BLE_RegisterServiceEventHandler(&Cy_BLE_IPS_EventHandler);

        /* Registers a callback function via config structure */
        if(cy_ble_ipsConfigPtr->callbackFunc != NULL)
        {
            Cy_BLE_IPS_ApplCallback = cy_ble_ipsConfigPtr->callbackFunc;
        }

    #ifdef CY_BLE_IPS_CLIENT
        {
            uint32_t idx;
            for(idx = 0u; idx < CY_BLE_CONFIG_GATTC_COUNT; idx++)
            {
                cy_ble_ipscRdLongBuffPtr[idx] = NULL;
                cy_ble_ipscRdLongBuffLen[idx] = 0u;
                cy_ble_ipscCurrLen[idx] = 0u;

                if(cy_ble_serverInfo[idx][CY_BLE_SRVI_IPS].range.startHandle == CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)
                {
                    (void)memset(&cy_ble_ipsc[idx], 0, sizeof(cy_stc_ble_ipsc_t));

                    /* initialize uuid  */
                    cy_ble_serverInfo[idx][CY_BLE_SRVI_IPS].uuid = CY_BLE_UUID_IPS_SERVICE;
                }
                cy_ble_ipscReqHandle[idx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
            }
        }
    #endif /* CY_BLE_IPS_CLIENT */
    }

    return(apiResult);
}

/******************************************************************************
* Function Name: Cy_BLE_IPS_RegisterAttrCallback
***************************************************************************//**
*
*  Registers a callback function for service specific attribute operations.
*  Service specific write requests from peer device will not be handled with
*  unregistered callback function.
*
*  \param callbackFunc:  An application layer event callback function to receive
*                 events from the BLE Component. The definition of
*                 cy_ble_callback_t for IPS Service is:\n
*                 typedef void (* cy_ble_callback_t) (uint32_t eventCode,
*                                                    void *eventParam)
*                 * eventCode:  Indicates the event that triggered this callback
*                   (e.g. CY_BLE_EVT_IPS_NOTIFICATION_ENABLED).
*                 * eventParam: Contains the parameters corresponding to the
*                   current event. (e.g. Pointer to cy_stc_ble_ips_char_value_t
*                   structure that contains details of the characteristic
*                   for which the notification enabled event was triggered).
*
*
*  \return
*  cy_en_ble_api_result_t : Return value indicates if the function succeeded or
*  failed. The following are possible error codes:
*
*   Error Codes                             | Description
*   ------------                            | -----------
*   CY_BLE_SUCCESS                          | The function completed successfully.
*   CY_BLE_ERROR_INVALID_OPERATION          | This operation is not permitted
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_IPS_RegisterAttrCallback(cy_ble_callback_t callbackFunc)
{
    cy_en_ble_api_result_t apiResult = CY_BLE_SUCCESS;
    
    Cy_BLE_IPS_ApplCallback = callbackFunc;
    if(cy_ble_ipsConfigPtr != NULL)
    {
        cy_ble_ipsConfigPtr->callbackFunc = callbackFunc;
    }
    else
    {
        apiResult = CY_BLE_ERROR_INVALID_OPERATION;
    }
    
    return(apiResult);
}


