ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_ips.c
#ifdef CY_BLE_IPS_SERVER

/******************************************************************************
* Function Name: Cy_BLE_IPSS_WriteEventHandler
***************************************************************************//**
*
*  Handles the Write Request Event.
*
*  \param eventParam: The pointer to the data structure specified by the event.
*
*  \return
*  cy_en_ble_gatt_err_code_t - A function result state if it succeeded
*  (CY_BLE_GATT_ERR_NONE) or failed with error codes:
*   * CY_BLE_GATTS_ERR_PROCEDURE_ALREADY_IN_PROGRESS
*   * CY_BLE_GATTS_ERR_CCCD_IMPROPERLY_CONFIGURED
* 
*  NOTE: when advertisement is active this API uses Cy_BLE_GAPP_UpdateAdvScanData() to 
*        update the advertisement packet. In the case of successful execution (return value = CY_BLE_SUCCESS)
*        the event CY_BLE_EVT_GAPP_UPDATE_ADV_SCAN_DATA_COMPLETE appears.
******************************************************************************/
static cy_en_ble_gatt_err_code_t Cy_BLE_IPSS_WriteEventHandler(cy_stc_ble_gatts_write_cmd_req_param_t *eventParam)
{
    cy_en_ble_gatt_err_code_t gattErr = CY_BLE_GATT_ERR_NONE;

    if(Cy_BLE_IPS_ApplCallback != NULL)
    {
        cy_stc_ble_ips_char_value_t locCharValue =
        {
            .connHandle    = eventParam->connHandle,
            .gattErrorCode = CY_BLE_GATT_ERR_NONE
        };

        for(locCharValue.charIndex = CY_BLE_IPS_INDOOR_POSITINING_CONFIG; locCharValue.charIndex < CY_BLE_IPS_CHAR_COUNT;
            locCharValue.charIndex++)
        {
            if((eventParam->handleValPair.attrHandle ==
                cy_ble_ipsConfigPtr->ipss->charInfo[locCharValue.charIndex].charHandle) ||
               (eventParam->handleValPair.attrHandle ==
                cy_ble_ipsConfigPtr->ipss->charInfo[locCharValue.charIndex].descrHandle[CY_BLE_IPS_SCCD]) ||
               (eventParam->handleValPair.attrHandle ==
                cy_ble_ipsConfigPtr->ipss->charInfo[locCharValue.charIndex].descrHandle[CY_BLE_IPS_CEPD]))
            {
                gattErr = Cy_BLE_GATT_DbCheckPermission(eventParam->handleValPair.attrHandle, &eventParam->connHandle,
                                                        CY_BLE_GATT_DB_WRITE | CY_BLE_GATT_DB_PEER_INITIATED);

                if(gattErr == CY_BLE_GATT_ERR_NONE)
                {
                    locCharValue.value = &eventParam->handleValPair.value;

                    if(!CY_BLE_GATT_DB_ATTR_CHECK_PRPTY(eventParam->handleValPair.attrHandle,
                                                        CY_BLE_GATT_DB_CH_PROP_WRITE))
                    {
                        gattErr = CY_BLE_GATT_ERR_WRITE_NOT_PERMITTED;
                    }
                    else if(eventParam->handleValPair.value.len >
                            CY_BLE_GATT_DB_ATTR_GET_ATTR_GEN_MAX_LEN(eventParam->handleValPair.attrHandle))
                    {
                        gattErr = CY_BLE_GATT_ERR_INVALID_ATTRIBUTE_LEN;
                    }
                    else
                    {
                        Cy_BLE_IPS_ApplCallback((uint32_t)CY_BLE_EVT_IPSS_WRITE_CHAR, &locCharValue);

                        if(locCharValue.gattErrorCode == CY_BLE_GATT_ERR_USER_DATA_ACCESS_NOT_PERMITTED)
                        {
                            gattErr = CY_BLE_GATT_ERR_USER_DATA_ACCESS_NOT_PERMITTED;
                        }
                        else
                        {
                            cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
                            {
                                .handleValuePair = eventParam->handleValPair,
                                .connHandle      = eventParam->connHandle,
                                .offset          = 0u,
                                .flags           = CY_BLE_GATT_DB_PEER_INITIATED
                            };
                            gattErr = Cy_BLE_GATTS_WriteAttributeValueCCCD(&dbAttrValInfo);

                            if((gattErr == CY_BLE_GATT_ERR_NONE) &&
                               (eventParam->handleValPair.attrHandle == cy_ble_ipsConfigPtr->
                                 ipss->charInfo[locCharValue.charIndex].charHandle))
                            {
                                CY_BLE_GATT_DB_ATTR_SET_ATTR_GEN_LEN
                                    (cy_ble_ipsConfigPtr->ipss->charInfo[locCharValue.charIndex].charHandle,
                                    locCharValue.value->len);

                                (void)Cy_BLE_IPSS_SetAdvertisementData();
                            }
                        }
                    }
                }
                cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
                break;
            }
        }
    }


    return(gattErr);
}

/******************************************************************************
* Function Name: Cy_BLE_IPSS_WriteCmdEventHandler
***************************************************************************//**
*
*  Handles the Write Without Response Request Event.
*
*  \param eventParam:  The pointer to the data structure specified by the event.
*
*  NOTE: when advertisement is active this API uses Cy_BLE_GAPP_UpdateAdvScanData() to 
*        update the advertisement packet. In the case of successful execution (return value = CY_BLE_SUCCESS)
*        the event CY_BLE_EVT_GAPP_UPDATE_ADV_SCAN_DATA_COMPLETE appears.
*
******************************************************************************/
static void Cy_BLE_IPSS_WriteCmdEventHandler(cy_stc_ble_gatts_write_cmd_req_param_t *eventParam)
{
    cy_stc_ble_ips_char_value_t locCharValue =
    {
        .connHandle = eventParam->connHandle,
        .value      = &eventParam->handleValPair.value
    };
    cy_en_ble_gatt_err_code_t gattErr;

    for(locCharValue.charIndex = CY_BLE_IPS_INDOOR_POSITINING_CONFIG; locCharValue.charIndex < CY_BLE_IPS_CHAR_COUNT;
        locCharValue.charIndex++)
    {
        if((eventParam->handleValPair.attrHandle ==
            cy_ble_ipsConfigPtr->ipss->charInfo[locCharValue.charIndex].charHandle) &&
           (Cy_BLE_IPS_ApplCallback != NULL))
        {
            cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
            {
                .handleValuePair = eventParam->handleValPair,
                .connHandle      = eventParam->connHandle,
                .offset          = 0u,
                .flags           = CY_BLE_GATT_DB_PEER_INITIATED
            };
            gattErr = Cy_BLE_GATTS_WriteAttributeValueCCCD(&dbAttrValInfo);

            if(gattErr == CY_BLE_GATT_ERR_NONE)
            {
                Cy_BLE_IPS_ApplCallback((uint32_t)CY_BLE_EVT_IPSS_WRITE_CHAR, &locCharValue);
                (void)Cy_BLE_IPSS_SetAdvertisementData();
            }
            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
        }
    }
}

