ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_ips.c
#if (CY_BLE_GAP_ROLE_PERIPHERAL)

/******************************************************************************
* Function Name: Cy_BLE_IPSS_SetAdvertisementData
***************************************************************************//**
*
*  Sets the characteristics values in advertisement packet depending on a value of
*  Indoor Positioning Configuration characteristic.
*
*  This function must be called when Cy_BLE_GetBleSsState() returns
*  CY_BLE_BLESS_STATE_EVENT_CLOSE state.
*
* \return
*  A return value is of type cy_en_ble_api_result_t.
*  * CY_BLE_SUCCESS - The advertisement packet collected successfully.
*  * CY_BLE_ERROR_INVALID_PARAMETER - Read operation is not permitted on this
*                attribute or on NULL pointer, Data length in input
*                parameter exceeds 31 bytes.
*  * CY_BLE_ERROR_INVALID_OPERATION - The advertisement packet doesn't contain
*                the User List or it is to small or ADV Event is not closed,
*                BLESS is active or ADV is not enabled.
*
*
******************************************************************************/
static cy_en_ble_api_result_t Cy_BLE_IPSS_SetAdvertisementData(void)
{
    uint32_t fFlag;
    uint8_t adLength;
    uint8_t dataLengthAddress = 0u;
    uint8_t byteCounter;
    cy_en_ble_api_result_t apiResult = CY_BLE_SUCCESS;
    uint8_t ipssConfigFlags;
    uint8_t advIndex = 0u;

    do
    {
        byteCounter = 0u;
        fFlag = 0u;
        while((byteCounter < cy_ble_configPtr->discoveryModeInfo[advIndex].advData->advDataLen) && (fFlag == 0u))
        {
            adLength = cy_ble_configPtr->discoveryModeInfo[advIndex].advData->advData[byteCounter];

            if(adLength != 0u)
            {
                /* Increment byte counter so that it points to AD type field */
                byteCounter++;

                if(cy_ble_configPtr->discoveryModeInfo[advIndex].advData->advData[byteCounter] == CY_BLE_IPS_AD_TYPE)
                {
                    /* Start if a "Indoor Positioning" AD type was found. Set flag and exit the loop. */
                    fFlag = 1u;
                    dataLengthAddress = byteCounter - 1u;
                }
                else
                {
                    byteCounter += adLength;
                }
            }
            else
            {
                /* End of advertisement data structure was encountered so exit loop. */
                break;
            }
        }

        if(fFlag != 0u)
        {
            /* Get Configuration value from GATT database */
            cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
            {
                .offset = 0u,
                .flags  = CY_BLE_GATT_DB_LOCALLY_INITIATED
            };

            dbAttrValInfo.handleValuePair.attrHandle = cy_ble_ipsConfigPtr->ipss->
                                                        charInfo[CY_BLE_IPS_INDOOR_POSITINING_CONFIG].charHandle;
            dbAttrValInfo.handleValuePair.value.len = 1u;
            dbAttrValInfo.handleValuePair.value.val = &ipssConfigFlags;

            /* Increment byte counter to point to Indoor Positioning data */
            byteCounter++;

            if(Cy_BLE_GATTS_ReadAttributeValueCCCD(&dbAttrValInfo) != CY_BLE_GATT_ERR_NONE)
            {
                apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
            }
            else if((ipssConfigFlags & CY_BLE_IPS_CHARACTERISTICS_IN_ADVERTISING) != 0u)
            {
                cy_ble_configPtr->discoveryModeInfo[advIndex].advData->advData[byteCounter] = ipssConfigFlags;
                byteCounter++;

                if((ipssConfigFlags & CY_BLE_IPS_COORDINATES_IN_ADVERTISING) != 0u)
                {
                    if((ipssConfigFlags & CY_BLE_IPS_TYPE_OF_COORDINATE_IN_ADVERTISING) == CY_BLE_IPS_WGS84_COORDINATE)
                    {
                        /* CY_BLE_IPS_WGS84_COORDINATE
                         * Latitude
                         */
                        dbAttrValInfo.handleValuePair.attrHandle = cy_ble_ipsConfigPtr->ipss->
                                                                    charInfo[CY_BLE_IPS_LATITUDE].charHandle;
                        dbAttrValInfo.handleValuePair.value.len = 4u;
                        dbAttrValInfo.handleValuePair.value.val = &cy_ble_configPtr->discoveryModeInfo[advIndex].
                                                                   advData->advData[byteCounter];

                        if(Cy_BLE_GATTS_ReadAttributeValueCCCD(&dbAttrValInfo) != CY_BLE_GATT_ERR_NONE)
                        {
                            apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
                        }
                        byteCounter += (uint8_t)dbAttrValInfo.handleValuePair.value.len;

                        /* Longitude */
                        dbAttrValInfo.handleValuePair.attrHandle = cy_ble_ipsConfigPtr->ipss->
                                                                    charInfo[CY_BLE_IPS_LONGITUDE].charHandle;
                        dbAttrValInfo.handleValuePair.value.len = 4u;
                        dbAttrValInfo.handleValuePair.value.val = &cy_ble_configPtr->discoveryModeInfo[advIndex].
                                                                   advData->advData[byteCounter];

                        if(Cy_BLE_GATTS_ReadAttributeValueCCCD(&dbAttrValInfo) != CY_BLE_GATT_ERR_NONE)
                        {
                            apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
                        }
                        byteCounter += (uint8_t)dbAttrValInfo.handleValuePair.value.len;
                    }
                    else
                    {   /*  CY_BLE_IPS_LOCAL_COORDINATE
                         * North coordinate
                         */
                        dbAttrValInfo.handleValuePair.attrHandle = cy_ble_ipsConfigPtr->ipss->
                                                                    charInfo[CY_BLE_IPS_LOCAL_NORTH_COORDINATE].charHandle;
                        dbAttrValInfo.handleValuePair.value.len = 2u;
                        dbAttrValInfo.handleValuePair.value.val = &cy_ble_configPtr->discoveryModeInfo[advIndex].
                                                                   advData->advData[byteCounter];

                        if(Cy_BLE_GATTS_ReadAttributeValueCCCD(&dbAttrValInfo) != CY_BLE_GATT_ERR_NONE)
                        {
                            apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
                        }
                        byteCounter += (uint8_t)dbAttrValInfo.handleValuePair.value.len;

