ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_ips.c
                        /* East coordinate */
                        dbAttrValInfo.handleValuePair.attrHandle = cy_ble_ipsConfigPtr->ipss->
                                                                    charInfo[CY_BLE_IPS_LOCAL_EAST_COORDINATE].charHandle;
                        dbAttrValInfo.handleValuePair.value.len = 2u;
                        dbAttrValInfo.handleValuePair.value.val = &cy_ble_configPtr->discoveryModeInfo[advIndex].
                                                                   advData->advData[byteCounter];

                        if(Cy_BLE_GATTS_ReadAttributeValueCCCD(&dbAttrValInfo) != CY_BLE_GATT_ERR_NONE)
                        {
                            apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
                        }
                        byteCounter += (uint8_t)dbAttrValInfo.handleValuePair.value.len;
                    }
                }

                if((ipssConfigFlags & CY_BLE_IPS_TX_POWER_IN_ADVERTISING) != 0u)
                {
                    cy_ble_configPtr->discoveryModeInfo[advIndex].advData->advData[byteCounter] = 0xAAu;
                    byteCounter++;
                }

                if((ipssConfigFlags & CY_BLE_IPS_FLOOR_NUMBER_IN_ADVERTISING) != 0u)
                {
                    dbAttrValInfo.handleValuePair.attrHandle = cy_ble_ipsConfigPtr->ipss->
                                                                charInfo[CY_BLE_IPS_FLOOR_NUMBER].charHandle;
                    dbAttrValInfo.handleValuePair.value.len = 1u;
                    dbAttrValInfo.handleValuePair.value.val = &cy_ble_configPtr->discoveryModeInfo[advIndex].
                                                               advData->advData[byteCounter];

                    if(Cy_BLE_GATTS_ReadAttributeValueCCCD(&dbAttrValInfo) != CY_BLE_GATT_ERR_NONE)
                    {
                        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
                    }
                    byteCounter += (uint8_t)dbAttrValInfo.handleValuePair.value.len;
                }

                if((ipssConfigFlags & CY_BLE_IPS_ALTITUDE_IN_ADVERTISING) != 0u)
                {
                    dbAttrValInfo.handleValuePair.attrHandle = cy_ble_ipsConfigPtr->ipss->charInfo[CY_BLE_IPS_ALTITUDE].
                                                                charHandle;
                    dbAttrValInfo.handleValuePair.value.len = 2u;
                    dbAttrValInfo.handleValuePair.value.val = &cy_ble_configPtr->discoveryModeInfo[advIndex].
                                                               advData->advData[byteCounter];

                    if(Cy_BLE_GATTS_ReadAttributeValueCCCD(&dbAttrValInfo) != CY_BLE_GATT_ERR_NONE)
                    {
                        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
                    }
                    byteCounter += (uint8_t)dbAttrValInfo.handleValuePair.value.len;
                }

                if((ipssConfigFlags & CY_BLE_IPS_UNCERTAINTY_NUMBER_IN_ADVERTISING) != 0u)
                {
                    dbAttrValInfo.handleValuePair.attrHandle = cy_ble_ipsConfigPtr->ipss->
                                                                charInfo[CY_BLE_IPS_UNCERTAINTY].charHandle;
                    dbAttrValInfo.handleValuePair.value.len = 2u;
                    dbAttrValInfo.handleValuePair.value.val = &cy_ble_configPtr->discoveryModeInfo[advIndex].
                                                               advData->advData[byteCounter];

                    if(Cy_BLE_GATTS_ReadAttributeValueCCCD(&dbAttrValInfo) != CY_BLE_GATT_ERR_NONE)
                    {
                        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
                    }
                    byteCounter += (uint8_t)dbAttrValInfo.handleValuePair.value.len;
                }
            }
            else /* No CY_BLE_IPS_CHARACTERISTICS_IN_ADVERTISING  */
            {
            }

            cy_ble_configPtr->discoveryModeInfo[advIndex].advData->advData[dataLengthAddress] =
                byteCounter - dataLengthAddress - 1u;
            cy_ble_configPtr->discoveryModeInfo[advIndex].advData->advDataLen = byteCounter;
        }

        advIndex++;
    }
    while(advIndex < CY_BLE_GAPP_CONF_COUNT);

    if(Cy_BLE_GetAdvertisementState() == CY_BLE_ADV_STATE_ADVERTISING)
    {
        apiResult = Cy_BLE_GAPP_UpdateAdvScanData(&cy_ble_configPtr->discoveryModeInfo[cy_ble_advIndex]);
    }

    return(apiResult);
}

#endif /* (CY_BLE_GAP_ROLE_PERIPHERAL) */

#endif /* CY_BLE_IPS_SERVER */

#ifdef CY_BLE_IPS_CLIENT

/******************************************************************************
* Function Name: Cy_BLE_IPSC_SetCharacteristicValueWithoutResponse
***************************************************************************//**
*
*  This function is used to write the characteristic (which is identified by
*  charIndex) value attribute in the server without response.
*
*
*  \param connHandle: The connection handle.
*  \param charIndex:  The index of the service characteristic.
*  \param attrSize:   The size of the characteristic value attribute.
*  \param attrValue:  The pointer to the characteristic value data that should be
*                     sent to the server device.
*
* \return
*  A return value is of type cy_en_ble_api_result_t.
*  * CY_BLE_SUCCESS - The request was sent successfully.
*  * CY_BLE_ERROR_INVALID_PARAMETER - Validation of the input parameters failed.
*  * CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED - Memory allocation failed.
*  * CY_BLE_ERROR_INVALID_STATE - Connection with the server is not established.
*  * CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE - The peer device doesn't have
*                                              the particular characteristic.
*  * CY_BLE_ERROR_INVALID_OPERATION - Operation is invalid for this
*                                    characteristic.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_IPSC_SetCharacteristicValueWithoutResponse(cy_stc_ble_conn_handle_t connHandle,
                                                                         cy_en_ble_ips_char_index_t charIndex,
                                                                         uint8_t attrSize,
                                                                         uint8_t * attrValue)
{
    cy_en_ble_api_result_t apiResult;
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(connHandle);
    cy_stc_ble_gatt_xchg_mtu_param_t mtuParam = { .connHandle = connHandle };

    (void)Cy_BLE_GATT_GetMtuSize(&mtuParam);

    /* Check parameters */
    if(Cy_BLE_GetConnectionState(connHandle) != CY_BLE_CONN_STATE_CLIENT_DISCOVERED)
    {
        apiResult = CY_BLE_ERROR_INVALID_STATE;
    }
    else if((charIndex >= CY_BLE_IPS_CHAR_COUNT) || (discIdx >= CY_BLE_CONFIG_GATTC_COUNT))
    {
        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
    }
    else if(cy_ble_ipsc[discIdx].charInfo[charIndex].valueHandle == CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)
    {
        apiResult = CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE;
    }
    else if((CY_BLE_CHAR_PROP_WRITE & cy_ble_ipsc[discIdx].charInfo[charIndex].properties) == 0u)
    {
        apiResult = CY_BLE_ERROR_INVALID_OPERATION;
    }
    else if((mtuParam.mtu - CY_BLE_GATT_WRITE_HEADER_LEN) < attrSize)
    {
        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
    }
    else
    {
        cy_stc_ble_gattc_write_cmd_req_t writeCmdReqParam =
        {
            .handleValPair.attrHandle = cy_ble_ipsc[discIdx].charInfo[charIndex].valueHandle,
            .handleValPair.value.val  = attrValue,
            .handleValPair.value.len  = attrSize,
            .connHandle               = connHandle
        };
        apiResult = Cy_BLE_GATTC_WriteWithoutResponse(&writeCmdReqParam);

        if(apiResult == CY_BLE_SUCCESS)
        {
            cy_ble_ipscReqHandle[discIdx] = cy_ble_ipsc[discIdx].charInfo[charIndex].valueHandle;
        }
    }

    return(apiResult);
}

