ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_ips.c
/******************************************************************************
* Function Name: Cy_BLE_IPSC_GetMultipleCharacteristicValues
***************************************************************************//**
*
*  This function reads multiple Characteristic Values from a GATT Server when
*  the GATT Client knows the Characteristic value handles. This is a
*  non-blocking function.
*
*  Internally, Read Multiple Request is sent to the peer device in response to
*  which Read Multiple Response is received. This results in
*  CY_BLE_EVT_GATTC_READ_MULTI_RSP event, which is propagated to the application
*  layer.
*
*  An Error Response event is sent by the server (CY_BLE_EVT_GATTC_ERROR_RSP) in
*  response to the Read Multiple Request if insufficient authentication,
*  insufficient authorization, insufficient encryption key size is used by the
*  client, or if a read operation is not permitted on any of the Characteristic
*  values. The Error Code parameter is set as specified in the Attribute
*  Protocol.
*
*  Refer to Bluetooth 4.1 core specification, Volume 3, Part G, section 4.8.4
*  for more details on the sequence of operations.
*
*  \param connHandle: Connection handle to identify the peer GATT entity, of type
*               cy_stc_ble_conn_handle_t.
*  \param charIndexesList: Pointer to a list of Characteristic value handles
*  \param numberOfCharIndexes: Number of requested Characteristic handles
*
* \return
*  cy_en_ble_api_result_t : Return value indicates if the function succeeded or
*  failed. Following are the possible error codes.
*
*  Errors codes                              | Description
*  ------------                              | -----------
*   CY_BLE_SUCCESS                           | On successful operation
*   CY_BLE_ERROR_INVALID_PARAMETER           | 'connHandle' value does not represent any existing entry in the Stack
*   CY_BLE_ERROR_INVALID_OPERATION           | This operation is not permitted
*   CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED    | Memory allocation failed
*   CY_BLE_ERROR_INVALID_STATE               | Connection with the Client is not established.
*   CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE | The peer device doesn't have the particular characteristic.
*
* \events
*  In case of successful execution (return value = CY_BLE_SUCCESS)
*  the next events can appear: \n
*   If the IPS service-specific callback is registered
*      (with Cy_BLE_IPS_RegisterAttrCallback):
*  * CY_BLE_EVT_IPSC_READ_MULTIPLE_CHAR_RESPONSE - If the requested attribute is
*                                successfully written on the peer device,
*                                the details (char index , value, etc.) are
*                                provided with an event parameter structure
*                                of type cy_stc_ble_ips_char_value_t.
*  .
*   Otherwise (if the IPS service-specific callback is not registered):
*  * CY_BLE_EVT_GATTC_READ_MULTI_RSP - If the requested attribute is
*                                successfully read on the peer device,
*                                the details (handle, value, etc.) are
*                                provided with an event parameter
*                                structure (cy_stc_ble_gattc_read_rsp_param_t).
*  * CY_BLE_EVT_GATTC_ERROR_RSP - If there is some trouble with the
*                                requested attribute on the peer device,
*                                the details are provided with an event parameter
*                                structure (cy_stc_ble_gatt_err_param_t).
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_IPSC_GetMultipleCharacteristicValues(cy_stc_ble_conn_handle_t connHandle,
                                                                   const cy_en_ble_ips_char_index_t  *charIndexesList,
                                                                   uint8_t numberOfCharIndexes)

{
    cy_en_ble_api_result_t apiResult = CY_BLE_SUCCESS;
    cy_stc_ble_gattc_read_mult_req_t readMultiReqParam = { .connHandle = connHandle };
    uint16_t valueHandles[CY_BLE_IPS_CHAR_COUNT];
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(connHandle);
    uint32_t indexInList;

    /* Check parameters */
    if(Cy_BLE_GetConnectionState(connHandle) != CY_BLE_CONN_STATE_CLIENT_DISCOVERED)
    {
        apiResult = CY_BLE_ERROR_INVALID_STATE;
    }
    else if(discIdx >= CY_BLE_CONFIG_GATTC_COUNT)
    {
        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
    }
    else
    {
        for(indexInList = 0u; ((indexInList < numberOfCharIndexes) && (apiResult == CY_BLE_SUCCESS)); indexInList++)
        {
            if(cy_ble_ipsc[discIdx].charInfo[charIndexesList[indexInList]].valueHandle ==
               CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)
            {
                apiResult = CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE;
            }
            else if((CY_BLE_CHAR_PROP_READ & cy_ble_ipsc[discIdx].charInfo[charIndexesList[indexInList]].properties) == 0u)
            {
                apiResult = CY_BLE_ERROR_INVALID_OPERATION;
            }
            else
            {
                valueHandles[indexInList] = cy_ble_ipsc[discIdx].charInfo[charIndexesList[indexInList]].valueHandle;
            }
        }

        if(apiResult == CY_BLE_SUCCESS)
        {
            readMultiReqParam.handleListType.listCount = numberOfCharIndexes;
            readMultiReqParam.handleListType.handleList = valueHandles;
            apiResult = Cy_BLE_GATTC_ReadMultipleCharacteristicValues(&readMultiReqParam);
        }
    }

    return(apiResult);
}


/******************************************************************************
* Function Name: Cy_BLE_IPSC_SetCharacteristicDescriptor
***************************************************************************//**
*
*  This function is used to write the characteristic Value to the server,
*  as identified by its charIndex.
*
*  \param connHandle: The connection handle.
*  \param charIndex:  The index of the service characteristic.
*  \param descrIndex: The index of the service characteristic descriptor.
*  \param attrSize:   The size of the characteristic descriptor value attribute.
*  \param attrValue: The pointer to the characteristic descriptor value data that
*                      should be sent to the server device.
*
* \return
*  A return value is of type cy_en_ble_api_result_t.
*  * CY_BLE_SUCCESS - The request was sent successfully.
*  * CY_BLE_ERROR_INVALID_PARAMETER - Validation of the input parameters failed.
*  * CY_BLE_ERROR_INVALID_STATE - The state is not valid.
*  * CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED - Memory allocation failed.
*  * CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE - The peer device doesn't have
*                                              the particular characteristic.
*  * CY_BLE_ERROR_INVALID_OPERATION - This operation is not permitted on
*                                    the specified attribute
*
* \events
*  In the case of successful execution (return value = CY_BLE_SUCCESS)
*  the next events can appear: \n
*   If the IPS service-specific callback is registered
*      (with Cy_BLE_IPS_RegisterAttrCallback):
*  * CY_BLE_EVT_IPSC_WRITE_DESCR_RESPONSE - If the requested attribute is
*                                successfully written on the peer device,
*                                the details (char index, descr index etc.) are
*                                provided with an event parameter structure
*                                of type cy_stc_ble_ips_descr_value_t.
*  .
*   Otherwise (if the IPS service-specific callback is not registered):
*  * CY_BLE_EVT_GATTC_WRITE_RSP - If the requested attribute is
*                                successfully written on the peer device.
*  * CY_BLE_EVT_GATTC_ERROR_RSP - If there is some trouble with the
*                                requested attribute on the peer device,
*                                the details are provided with an event parameter
*                                structure (cy_stc_ble_gatt_err_param_t).
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_IPSC_SetCharacteristicDescriptor(cy_stc_ble_conn_handle_t connHandle,
                                                               cy_en_ble_ips_char_index_t charIndex,
                                                               cy_en_ble_ips_descr_index_t descrIndex,
                                                               uint8_t attrSize,
                                                               uint8_t * attrValue)
{
    cy_en_ble_api_result_t apiResult;
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(connHandle);

    /* Check parameters */
    if(Cy_BLE_GetConnectionState(connHandle) != CY_BLE_CONN_STATE_CLIENT_DISCOVERED)
    {
        apiResult = CY_BLE_ERROR_INVALID_STATE;
    }
    else if((charIndex >= CY_BLE_IPS_CHAR_COUNT) || (descrIndex >= CY_BLE_IPS_DESCR_COUNT) || 
            (attrSize != CY_BLE_CCCD_LEN) || (discIdx >= CY_BLE_CONFIG_GATTC_COUNT))
    {
        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
    }
    else if(cy_ble_ipsc[discIdx].charInfo[charIndex].descrHandle[descrIndex] == CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)
    {
        apiResult = CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE;
    }
    else
    {
        /* Fill all fields of write request structure ... */
        cy_stc_ble_gattc_write_req_t writeReqParam =
        {
            .handleValPair.attrHandle = cy_ble_ipsc[discIdx].charInfo[charIndex].descrHandle[descrIndex],
            .handleValPair.value.val  = attrValue,
            .handleValPair.value.len  = CY_BLE_CCCD_LEN,
            .connHandle               = connHandle
        };
        /* ... and send request to server device. */
        apiResult = Cy_BLE_GATTC_WriteCharacteristicDescriptors(&writeReqParam);
        if(apiResult == CY_BLE_SUCCESS)
        {
            /* Save handle to support service specific read response from device */
            cy_ble_ipscReqHandle[discIdx] = writeReqParam.handleValPair.attrHandle;
        }
    }

    return(apiResult);
}


